Autodesk.Revit.DB.AlignmentStationLabelSetOptionDefaults.GetDefaultOffsetValue(Autodesk.Revit.DB.Document)
Get the default offset value for the current length unit type in the document.
The return value is in internal units (standard imperial feet).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021.1

Autodesk.Revit.DB.AlignmentStationLabelSetOptionDefaults.GetDefaultIntervalValue(Autodesk.Revit.DB.Document)
Get the default interval value for the current stationing unit type in the document.
The return value is in internal units (standard imperial feet).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021.1

Autodesk.Revit.DB.AlignmentStationLabelSetOptionDefaults
An utility class for querying the default values of alignment station label set options.
Since:
2021.1